target/classes/samples/terminate-contract.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                 xmlns:con="http://example.gov.kz/esutd/soap/contract">
   <soapenv:Header/>
   <soapenv:Body>
      <con:ContractSyncRequest>
         <con:RequestInfo>
            <con:RequestId>REQ-2025-003</con:RequestId>
            <con:Timestamp>2025-05-30T16:45:00</con:Timestamp>
            <con:SourceSystem>ESUTD</con:SourceSystem>
         </con:RequestInfo>
         <con:ContractData>
            <con:Operation>TERMINATE_CONTRACT</con:Operation>
            <con:TerminationInfo>
               <con:ContractId>CTR-2025-100</con:ContractId>
               <con:TerminationDate>2025-05-30</con:TerminationDate>
               <con:TerminationReason>По соглашению сторон</con:TerminationReason>
               <con:TerminationReasonCode>MUTUAL_AGREEMENT</con:TerminationReasonCode>
            </con:TerminationInfo>
         </con:ContractData>
      </con:ContractSyncRequest>
   </soapenv:Body>
</soapenv:Envelope>